import React from 'react';
import classNames from 'classnames/bind';
import styles from './DetailPage.module.scss'
import { useSelector } from 'react-redux';
const cx=classNames.bind(styles)
const DetailPage = () => {
    const user = useSelector((state) => state.user)
    return (
        
        <div>
        <div  className={cx('detailPage')}>
            
        </div>
        <header  className={cx('topbar')}>
        <span className={cx('device-text')}>Thiết bị</span>
                 <svg className={cx('logo-next')}  xmlns="http://www.w3.org/2000/svg" width="6" height="10" viewBox="0 0 6 10" fill="none">
<path d="M5.35833 4.40874L1.825 0.875405C1.74753 0.797298 1.65536 0.735302 1.55381 0.692995C1.45226 0.650688 1.34334 0.628906 1.23333 0.628906C1.12332 0.628906 1.0144 0.650688 0.912851 0.692995C0.811302 0.735302 0.719134 0.797298 0.641665 0.875405C0.486456 1.03154 0.399338 1.24275 0.399338 1.4629C0.399338 1.68306 0.486456 1.89427 0.641665 2.0504L3.59167 5.0004L0.641665 7.9504C0.486456 8.10654 0.399338 8.31775 0.399338 8.5379C0.399338 8.75806 0.486456 8.96927 0.641665 9.1254C0.719532 9.20264 0.811878 9.26374 0.91341 9.30521C1.01494 9.34668 1.12366 9.3677 1.23333 9.36707C1.343 9.3677 1.45172 9.34668 1.55325 9.30521C1.65478 9.26374 1.74713 9.20264 1.825 9.1254L5.35833 5.59207C5.43644 5.5146 5.49843 5.42243 5.54074 5.32088C5.58305 5.21934 5.60483 5.11041 5.60483 5.0004C5.60483 4.89039 5.58305 4.78147 5.54074 4.67992C5.49843 4.57837 5.43644 4.48621 5.35833 4.40874Z" fill="#7E7D88"/>
</svg>
<span className={cx('device-index')}>Danh sách thiết bị</span>
<svg className={cx('logo-next-two')} xmlns="http://www.w3.org/2000/svg" width="6" height="10" viewBox="0 0 6 10" fill="none">
<path d="M5.35841 4.40874L1.82507 0.875405C1.74761 0.797298 1.65544 0.735302 1.55389 0.692995C1.45234 0.650688 1.34342 0.628906 1.23341 0.628906C1.1234 0.628906 1.01448 0.650688 0.912927 0.692995C0.811378 0.735302 0.71921 0.797298 0.641741 0.875405C0.486532 1.03154 0.399414 1.24275 0.399414 1.4629C0.399414 1.68306 0.486532 1.89427 0.641741 2.0504L3.59174 5.0004L0.641741 7.9504C0.486532 8.10654 0.399414 8.31775 0.399414 8.5379C0.399414 8.75806 0.486532 8.96927 0.641741 9.1254C0.719608 9.20264 0.811955 9.26374 0.913486 9.30521C1.01502 9.34668 1.12374 9.3677 1.23341 9.36707C1.34308 9.3677 1.4518 9.34668 1.55333 9.30521C1.65486 9.26374 1.74721 9.20264 1.82507 9.1254L5.35841 5.59207C5.43652 5.5146 5.49851 5.42243 5.54082 5.32088C5.58312 5.21934 5.60491 5.11041 5.60491 5.0004C5.60491 4.89039 5.58312 4.78147 5.54082 4.67992C5.49851 4.57837 5.43652 4.48621 5.35841 4.40874Z" fill="#7E7D88"/>
</svg>
<span className={cx('add-device')}>Chi tiết thiết bị</span> 
<svg className={cx('logo-ring')} xmlns="http://www.w3.org/2000/svg" width="32" height="32" viewBox="0 0 32 32" fill="none">
<rect width="32" height="32" rx="16" fill="#FFF2E7"/>
<path d="M22.1168 18.0753L21.2834 16.692C21.1084 16.3837 20.9501 15.8003 20.9501 15.4587V13.3503C20.9501 11.392 19.8001 9.70033 18.1418 8.90866C17.7084 8.14199 16.9084 7.66699 15.9918 7.66699C15.0834 7.66699 14.2668 8.15866 13.8334 8.93366C12.2084 9.74199 11.0834 11.417 11.0834 13.3503V15.4587C11.0834 15.8003 10.9251 16.3837 10.7501 16.6837L9.90845 18.0753C9.57512 18.6337 9.50012 19.2503 9.70845 19.817C9.90845 20.3753 10.3834 20.8087 11.0001 21.017C12.6168 21.567 14.3168 21.8337 16.0168 21.8337C17.7168 21.8337 19.4168 21.567 21.0334 21.0253C21.6168 20.8337 22.0668 20.392 22.2834 19.817C22.5001 19.242 22.4418 18.6087 22.1168 18.0753Z" fill="#FFAC6A"/>
<path d="M18.3582 22.6753C18.0082 23.642 17.0832 24.3337 15.9999 24.3337C15.3416 24.3337 14.6916 24.067 14.2332 23.592C13.9666 23.342 13.7666 23.0087 13.6499 22.667C13.7582 22.6837 13.8666 22.692 13.9832 22.7087C14.1749 22.7337 14.3749 22.7587 14.5749 22.7753C15.0499 22.817 15.5332 22.842 16.0166 22.842C16.4916 22.842 16.9666 22.817 17.4332 22.7753C17.6082 22.7587 17.7832 22.7503 17.9499 22.7253C18.0832 22.7087 18.2166 22.692 18.3582 22.6753Z" fill="#FFAC6A"/>
</svg>
<span  className={cx('img-bar')}></span>
<span  className={cx('hello-bar')}>Xin chào</span>
<span  className={cx('name-bar')}>{user.name}</span>
<span  className={cx('device-index-S')}>Quản lý thiết bị</span>
        </header>
        <div className={cx('content-block')}>
        <span  className={cx('info')}>Thông tin chi tiết</span>
        <span  className={cx('code-device')}>Mã thiết bị</span>
        <span  className={cx('code-device-content')}>KIO_01</span>
        <span  className={cx('name-code-device')}>Tên thiết bị</span>
        <span  className={cx('name-code-content')}>Kiosk</span>
        <span  className={cx('address')}>Địa chỉ IP:</span>
        <span  className={cx('address-content')}>128.172.308</span>
        <span  className={cx('service')}>Dịch vụ sử dụng:</span>
        <span  className={cx('service-content')}>Khám tim mạch, Khám sản - Phụ khoa, Khám răng hàm mặt, Khám tai mũi họng, Khám hô hấp, Khám tổng quát. </span>
        <span  className={cx('type-service')}>Loại thiết bị</span>
        <span  className={cx('type-service-content')}>Kiosk</span>
        <span  className={cx('loggin-name')}>Tên đăng nhập:</span>
        <span  className={cx('loggin-name-content')}>Linhkyo011</span>
        <span  className={cx('password')}>Mật khẩu:</span>
        <span  className={cx('password-content')}>CMS</span>
        </div>
        <div className={cx('right-bar')}>
        <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
<path fill-rule="evenodd" clip-rule="evenodd" d="M17.443 0.345066C19.1213 0.240174 20.7762 0.822905 22.0233 1.96506C23.1655 3.2121 23.7482 4.86705 23.655 6.55697V17.4424C23.7599 19.1323 23.1655 20.7873 22.035 22.0343C20.7879 23.1764 19.1213 23.7592 17.443 23.6543H6.55751C4.86758 23.7592 3.21261 23.1764 1.96556 22.0343C0.823397 20.7873 0.240662 19.1323 0.345554 17.4424V6.55697C0.240662 4.86705 0.823397 3.2121 1.96556 1.96506C3.21261 0.822905 4.86758 0.240174 6.55751 0.345066H17.443ZM10.8115 17.6522L18.6551 9.7853C19.366 9.06271 19.366 7.89725 18.6551 7.18632L17.14 5.67122C16.4174 4.94864 15.2519 4.94864 14.5293 5.67122L13.7485 6.46374C13.6319 6.58028 13.6319 6.77841 13.7485 6.89496C13.7485 6.89496 15.6016 8.73638 15.6365 8.783C15.7647 8.92286 15.8463 9.10933 15.8463 9.31911C15.8463 9.73868 15.5083 10.0883 15.0771 10.0883C14.879 10.0883 14.6925 10.0067 14.5643 9.87854L12.618 7.94387C12.5247 7.85063 12.3616 7.85063 12.2683 7.94387L6.70902 13.5031C6.32442 13.8877 6.10298 14.4005 6.09132 14.9483L6.02139 17.7104C6.02139 17.8619 6.06801 18.0018 6.17291 18.1067C6.2778 18.2116 6.41765 18.2699 6.56917 18.2699H9.30802C9.86745 18.2699 10.4036 18.0484 10.8115 17.6522Z" fill="#FF9138"/>
</svg>
        <span  className={cx('right-bar-text')}>Cập nhập thiết bị</span>
        </div>
        </div>
    );
}

export default DetailPage;
